namespace ReadyBusinesses.AI.Constants;

public static class ChatGPTRequest
{
    public static string Request =
        $"Я хочу отримати від тебе рекомендацію для готового бізнесу для продажу. Відповідай українською мовою." +
        $"Врахуй усі параметри та напиши свою рекомендацію для потенційного покупця та інвестора в цей готовий бізнес. " +
        $"Опиши детально сильні та слабкі сторони, на твою думку, прив'язуючись до наданих даних та додаючи власного контексту на власній базі даних про цей бізнес." +
        $"\n\nПоверни мені свою рекомендацію в форматі JSON. " +
        $"При цьому це має бути без жодного тексту, лише JSON. " +
        $"Я хочу, щоб ти видав мені в цей результат такі параметри: \n" +
        $"1. Масив критеріїв оцінок в строгому заданому порядку.  Критерії оцінки я надам тобі в контексті. " +
        $"Її назва в JSON повинна бути \"CriteriaMatrix\".\n" +
        $"2. Сильні сторони (плюси) як масив рядків. Як мінімум 5 значень. Її назва в JSON повинна бути \"Pluses\" \n" +
        $"3. Слабкі сторони (мінуси) як масив рядків. Як мінімум 5 значень. Її назва в JSON повинна бути \"Minuses\"\n" +
        $"4. Персональні рекомендації для потенційного інвестора від штучного інтелекту як масив рядків. Як мінімум 5 значень." +
        $" Її назва в JSON повинна бути \"Recommendations\".\n\nБудь обережним з оцінюванням, не виходь за межі оцінок та використовуй лише надані мною критерії. " +
        $"Для максимізованих параметрів значення 1 - найкращий результат, 0 - найгірший. " +
        $"Для мінімізованих параметрів значення 0 - найкращий результат, 1 - найгірший. " +
        $"Оцінюй в межах від 0 до 1.\n\n" +
        $"Для контексту:\nКритерії, за якими я хочу, щоб ти оцінив:\n" +
        $"1. Локація розміщення бізнесу. (Максимізація)\n" +
        $"2. Оцінка чистого прибутку (Максимізація)\n" +
        $"3. Оцінка окупності бізнесу (Мінімізація)\n" +
        $"4. Оцінка ціни бізнесу (Мінімізація)\n" +
        $"5. Оцінка середнього чеку (Максимізація)\n" +
        $"6. Оцінка середнього виторгу на місяць. (Максимізація)\n" +
        $"7. Оцінка адаптації до нинішніх умов в Україні. Включає в себе - наявність укриття, генераторів, еко-флоу, інтеграції з державними сервісами та популярними приватними сервісами (Максимізація)\n" +
        $"8. Оцінка команди, що працює в бізнесі. Персонал, менеджери, оцінка їх зарплати відповідно до ринкової, показники їх ефективності. (Максимізація)\n" +
        $"9. Оцінка важливості підтримку бізнесу від колишнього власника. (Тобто наскільки легко буде адаптуватись в цій сфері бізнесу новачку). (Максимізація)\n" +
        $"10. Оцінка \"популярності\" бізнесу. Включає наявність соціальних мереж та базу підписників. (Максимізація)\n" +
        $"11. Комплексна оцінка від тебе (Максимізація).\n\n" +
        $"На вхід даю тобі готовий бізнес в JSON-форматі: ";
}