using ReadyBusinesses.Common.Dto.Criteria;
using ReadyBusinesses.Common.Entities;

namespace ReadyBusinesses.AI.Constants;

public static class ChatGPTRequest
{
    public static string GetRequest(CriteriaDto[] criteria)
    {
        var criteriaText = string.Join("\n", criteria.Select((cr, index) => 
            $"{index + 1}. {cr.Name}. {(cr.IsMaximization ? "(Максимізація)" : "(Мінімізація)")}"));
        
        return $"Я хочу отримати від тебе рекомендацію для готового бізнесу для продажу. Відповідай українською мовою." +
        $"Врахуй усі параметри та напиши свою рекомендацію для потенційного покупця та інвестора в цей готовий бізнес. " +
        $"Опиши детально сильні та слабкі сторони, на твою думку, прив'язуючись до наданих даних та додаючи власного контексту на власній базі даних про цей бізнес." +
        $"\n\nПоверни мені свою рекомендацію в форматі JSON. " +
        $"При цьому це має бути без жодного тексту, лише JSON. " +
        $"Я хочу, щоб ти видав мені в цей результат такі параметри: \n" +
        $"1. Масив критеріїв оцінок в строгому заданому порядку.  Критерії оцінки я надам тобі в контексті. " +
        $"Її назва в JSON повинна бути \"CriteriaEstimates\". Об'єкт цього типу має містити числове значення Estimate (від 0 до 100) та ім'я критерію Criterion, за яким ця оцінка була здійснена. \n" +
        $"2. Сильні сторони (плюси) як масив рядків. Як мінімум 5 значень. Її назва в JSON повинна бути \"Pluses\" \n" +
        $"3. Слабкі сторони (мінуси) як масив рядків. Як мінімум 5 значень. Її назва в JSON повинна бути \"Minuses\"\n" +
        $"4. Персональні рекомендації для потенційного інвестора від штучного інтелекту як масив рядків. Як мінімум 5 значень." +
        $" Її назва в JSON повинна бути \"Recommendations\".\n\nБудь обережним з оцінюванням, не виходь за межі оцінок та використовуй лише надані мною критерії. " +
        $"Для максимізованих параметрів значення 100 - найкращий результат, 0 - найгірший. " +
        $"Для мінімізованих параметрів значення 0 - найкращий результат, 100 - найгірший. " +
        $"Оцінюй в межах від 0 до 100.\n\n" +
        $"Для контексту:\nКритерії, за якими я хочу, щоб ти оцінив:\n" +
        $"{criteriaText}\n" +
        $"На вхід даю тобі готовий бізнес в JSON-форматі: ";
    }
}