using ReadyBusinesses.Common.Dto.Criteria;
using ReadyBusinesses.Common.Entities;

namespace ReadyBusinesses.AI.Constants;

public static class ChatGPTRequest
{
    public static string GetRequest(CriteriaDto[] criteria)
    {
        var criteriaText = string.Join("\n", criteria.Select((cr, index) => 
            $"{index + 1}. {cr.Name}. {(cr.IsMaximization ? "(Максимізація)" : "(Мінімізація)")}"));
        
        return $"Я хочу отримати від тебе рекомендацію для готового бізнесу для продажу. Відповідай українською мовою." +
        $"Врахуй усі параметри та напиши свою рекомендацію для потенційного покупця та інвестора в цей готовий бізнес. " +
        $"Опиши детально сильні та слабкі сторони, на твою думку, прив'язуючись до наданих даних та додаючи власного контексту на власній базі даних про цей бізнес." +
        $"\n\nПоверни мені свою рекомендацію в форматі JSON. " +
        $"При цьому це має бути без жодного тексту, лише JSON. " +
        $"Я хочу, щоб ти видав мені в цей результат такі параметри: \n" +
        $"1. Масив критеріїв оцінок в строгому заданому порядку.  Критерії оцінки я надам тобі в контексті. " +
        $"Її назва в JSON повинна бути \"CriteriaEstimates\". Об'єкт цього типу має містити числове значення Estimate (від 0 до 100) та ім'я критерію Criterion, за яким ця оцінка була здійснена. \n" +
        $"2. Сильні сторони (плюси) як масив рядків. Як мінімум 5 значень. Її назва в JSON повинна бути \"Pluses\" \n" +
        $"3. Слабкі сторони (мінуси) як масив рядків. Як мінімум 5 значень. Її назва в JSON повинна бути \"Minuses\"\n" +
        $"4. Персональні рекомендації для потенційного інвестора від штучного інтелекту як масив рядків. Як мінімум 5 значень." +
        $" Її назва в JSON повинна бути \"Recommendations\".\n\nБудь обережним з оцінюванням, не виходь за межі оцінок та використовуй лише надані мною критерії. " +
        $"Для максимізованих параметрів значення 100 - найкращий результат, 0 - найгірший. " +
        $"Для мінімізованих параметрів значення 0 - найкращий результат, 100 - найгірший. " +
        $"Оцінюй в межах від 0 до 100.\n\n" +
        $"Для контексту:\nКритерії, за якими я хочу, щоб ти оцінив:\n" +
        $"{criteriaText}\n" +
        $"На вхід даю тобі готовий бізнес в JSON-форматі: ";
    }

    public static string GetGlobalRequest(CriteriaDto[] criteria)
    {
        var criteriaText = string.Join("\n", criteria.Select((cr, index) => 
            $"{index + 1}. Критерій: {cr.Name}. Поточна вага: {cr.Weight}"));

        return "Я хочу отримати від тебе глобальні вагові коефіцієнти для готових бізнесів для продажу. Відповідай українською мовою. " +
               "Врахуй усі параметри та поточні вагові коефіцієнти для свого вибору. " +
               "Не змінюй критерії, які я тобі дам, лише їх вагові коефіцієнти, враховуючи поточну ситуацію в Україні. " +
               "Тобто я хочу від тебе актуальні вагові коефієцінти для готових бізнесів для продажу по заданим критеріями." +
               "\n\nПоверни мені свою рекомендацію у форматі JSON." +
               "\nПри цьому це має бути без жодного тексту, лише JSON." +
               "\nЯ хочу, щоб ти видав мені в цей результат об'єкт з масивом вагових коефіцієнтів. Його назва в JSON повинна бути CriteriaWeights. " +
               "Для самої ваги використовуй ім'я \"Weight\". Для імені - \"Criterion\"." +
               "Їх сума для усіх параметрів обов'язково повинна дорівнювати 1. Дай мені результат з точністю до 4 знаків після коми." +
               "\n\nДля контексту: Критерії та їх вагові коефіцієнти станом на зараз \n:" +
               $"{criteriaText}\n";
    }
}